app/views/static_pages/home.html.erb

                <span><%= link_to "#{time_ago_in_words(contribution.created_at)} ago", contribution %> </span>
                <span><%= link_to "#{contribution.comments.size + contribution.replies.size} comments", contribution %></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."contribution_id" = ?  [["contribution_id", 9]]
SELECT COUNT(*) FROM "replies" WHERE "replies"."contribution_id" = ?  [["contribution_id", 9]]