app/views/asks/_ask.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."ask_id" = ?  [[nil, 1]]
---
  <span>
    <%= link_to "#{ask.comments.size} comments", ask %>