app/views/contributions/_contribution.html.erb

  <span>
    <%= link_to "#{contribution.comments.size} comments", contribution %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."contribution_id" = ?  ORDER BY "comments"."created_at" DESC  [["contribution_id", 9]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."contribution_id" = ?  [["contribution_id", 9]]