app/views/contributions/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."contribution_id" = ?  ORDER BY "comments"."created_at" DESC  [["contribution_id", 9]]
---

<% if @contribution.comments.empty? %>