app/controllers/asks_controller.rb

  def index
    @asks = Ask.all.order("created_at desc")
---
SELECT "asks".* FROM "asks"  ORDER BY "asks"."created_at" DESC, created_at desc

  def create
    @ask = Ask.new(ask_params)

    respond_to do |format|
      if @ask.save
---
INSERT INTO "asks" ("titulo", "user_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["titulo", "First Ask"], ["user_id", 2], ["text", "Can you comment my ask?"], ["created_at", "2016-04-26 08:47:35.565392"], ["updated_at", "2016-04-26 08:47:35.565392"]]

  def set_ask
    @ask = Ask.find(params[:id])
---
SELECT  "asks".* FROM "asks" WHERE "asks"."id" = ?  ORDER BY "asks"."created_at" DESC LIMIT 1  [["id", 1]]