app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"  ORDER BY "comments"."created_at" DESC
---
  def index
    @comments = Comment.all

INSERT INTO "comments" ("content", "user_id", "contribution_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "alalalaalala"], ["user_id", 6], ["contribution_id", 10], ["created_at", "2016-04-19 09:23:52.543749"], ["updated_at", "2016-04-19 09:23:52.543749"]]
---
  def create
    #@user = Comment.new(name: "asdkdkdkd")
    #@contribution = " "
    # @user.contributions.find(params[:contribution_id])
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "lele"], ["updated_at", "2016-04-20 10:06:56.030311"], ["id", 18]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ?  ORDER BY "comments"."created_at" DESC LIMIT 1  [["id", 18]]
---
    def set_comment
      @comment = Comment.find(params[:id])