app/controllers/contributions_controller.rb

  def index
    @contributions = Contribution.all
---
SELECT "contributions".* FROM "contributions" WHERE (url<>'' AND url<>' '  OR url is not null)  ORDER BY "contributions"."created_at" DESC, created_at desc

  def create
    @contribution = Contribution.new(contribution_params)

    respond_to do |format|
      if @contribution.save
---
INSERT INTO "contributions" ("titulo", "user_id", "url", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["titulo", "jkldsfjkdsjkads"], ["user_id", 1], ["url", "sdfa.com"], ["text", "fdsa"], ["created_at", "2016-04-18 14:40:00.030356"], ["updated_at", "2016-04-18 14:40:00.030356"]]

  def destroy
    @contribution.destroy
---
DELETE FROM "contributions" WHERE "contributions"."id" = ?  [["id", 1]]

    def set_contribution
      @contribution = Contribution.find(params[:id])
---
SELECT  "contributions".* FROM "contributions" WHERE "contributions"."id" = ?  ORDER BY "contributions"."created_at" DESC LIMIT 1  [["id", 8]]