app/controllers/replies_controller.rb

SELECT "replies".* FROM "replies"
---
  def index
    @replies = Reply.all

INSERT INTO "replies" ("content", "user_id", "contribution_id", "comment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "useless"], ["user_id", 6], ["contribution_id", 9], ["comment_id", 19], ["created_at", "2016-04-23 08:35:35.286124"], ["updated_at", "2016-04-23 08:35:35.286124"]]
---
  def create
    @reply = Reply.new(reply_params)

    respond_to do |format|
      if @reply.save

DELETE FROM "replies" WHERE "replies"."id" = ?  [["id", 1]]
---
  def destroy
    @reply.destroy

SELECT  "replies".* FROM "replies" WHERE "replies"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_reply
      @reply = Reply.find(params[:id])