app/controllers/static_pages_controller.rb

SELECT "contributions".* FROM "contributions"  ORDER BY "contributions"."created_at" DESC
---
  def home
    if params[:submission_type] == "show"
      @contributions = Contribution.where.not(url: '').order(created_at: :desc)