app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("user", "password", "about", "email", "showdead", "noprocrast", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["user", ""], ["password", ""], ["about", ""], ["email", ""], ["showdead", "f"], ["noprocrast", "f"], ["created_at", "2016-04-16 09:22:40.580189"], ["updated_at", "2016-04-16 09:22:40.580189"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "user" = ?, "password" = ?, "about" = ?, "email" = ?, "showdead" = ?, "noprocrast" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user", "adfsjafdsjids"], ["password", "klasdfjklasdfjlkd"], ["about", ""], ["email", ""], ["showdead", "f"], ["noprocrast", "f"], ["updated_at", "2016-04-16 10:15:33.554492"], ["id", 2]]